#include "_AV_Sensors.h"
#include "stm32f10x.h"

namespace src{

//======================================================================================================================== 
// Class AnalogSensor
//======================================================================================================================== 
/*
// Конструктор без параметров
AnalogSensor::AnalogSensor ()
 {}
 
	 
// Конструктор с параметрами
AnalogSensor::AnalogSensor (float ts, float tf)
{
	meanFilter.PutTsTf(ts, tf);
}
 
//------------------------------------------------------------------------------------------------------------------------ 
// Методы
//------------------------------------------------------------------------------------------------------------------------ 
	 
void AnalogSensor::SetCalibration	(uint16_t calibration)	// Положить калибровочный коэффициент
{
	_calibration_value = (float)calibration;
}
*/

//======================================================================================================================== 
// Class AnalogRmsSensor
//======================================================================================================================== 
 
// Конструктор без параметров. Устанавливаются значения по умолчанию ts = 200mks, tf = 0.1sec
AnalogRmsSensor::AnalogRmsSensor()
 {
	PutTsTf	(0.0002, 0.1);
 }


// Конструктор с параметрами
AnalogRmsSensor::AnalogRmsSensor (float ts, float tf)// : AnalogSensor(ts, tf)
{
	PutTsTf		(ts, tf);
}


	 

}

