//#####################################################################################
//	Файл				RTC.h
//	Название:		Таймер реального времени. STM
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 май 15 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#ifndef RTC_H
#define RTC_H

//#include "_Parameters.h"

#ifdef __cplusplus
 extern "C" {
#endif 

namespace src{	 

class Rtc{
	public:
    void init();
};
	
}	// namespace src
#ifdef __cplusplus
}
#endif
#endif	//define RTC_H

