//#####################################################################################
//	Файл				RTC.cpp
//	Название:		Таймер реального времени. STM
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 май 15 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#include "stm32f10x.h"
#include "__RTC.h"

using namespace src;

void Rtc::init()
{

}
