//#####################################################################################
//	Файл				Display.h
//	Название:		Отображение меню.
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 май 20 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#ifndef DISPLAY_H
#define DISPLAY_H

#include "stdint.h"
#include <stdio.h>
//#include <vector>
//#include <map>


#ifdef __cplusplus
 extern "C" {
#endif 

using namespace std;
   
namespace src{	 



}	// namespace src

//extern src::MenuEngine menuEngine;

#ifdef __cplusplus
}
#endif
#endif	//define DISPLAY_H




