//#####################################################################################
//	Файл				Engine.h
//	Название:		Движок меню. На базе автомата состояний.
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 апр 23 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#ifndef ENGINE_H
#define ENGINE_H


#ifdef __cplusplus
 extern "C" {
#endif 

namespace src{	 

class Engine{
	public:
	protected:
		long long	M;	// Состояние автомата меню
		int				IM;	// Индекс листига текущего меню

};
	
}	// namespace src
#ifdef __cplusplus
}
#endif
#endif	//define UART_HPP




