//#####################################################################################
//	Файл				_Parameters_User.cpp
//	Название:		Настроечные параметры.
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 апр 27 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################


#include "_Parameters.h"
#include "__Parameters_User.h"
#include <map>

using namespace src;
using namespace std;

// Объявление глобальных объектов

//=========================================================================================================
// Определение настроечных параметров
// Необходимо объявить их в _Parameters_User.h
//=========================================================================================================

Parameter par1      ( 1,    // _id        // Идентификатор параметра. Для привязки к FRAM
                      1,    // _menu      // Идентификатор меню.
                      "Элемент меню 1",  //_text      // Тестовая информация
                      256,  // _modbusAdr	// Адрес модбас
                      0,    // _modbusAdr2// Адрес модбас
                      123,  // _value     // Значение параметра
                      0,    // _size      // Размер параметра 0-16bit, 1-32bit, 3-резерв
                      1,    // _rw        // Разрешение на запись
                      0,    // _min       // Минимальное значение
                      100,  // _max       // Максимальное значение
                      1,    // _user      // Доступ в режиме пользователя
                      12),  // _def       // Значение по умолчанию

          par2      ( 2,    // _id        // Идентификатор параметра. Для привязки к FRAM
                      2,    // _menu      // Идентификатор меню.
                      "Элемент меню 2", //_text      // Тестовая информация
                      257,  // _modbusAdr	// Адрес модбас
                      0,    // _modbusAdr2	// Адрес модбас
                      321,  // _value     // Значение параметра
                      0,    // _size      // Размер параметра 0-16bit, 1-32bit, 3-резерв
                      1,    // _rw        // Разрешение на запись
                      0,    // _min       // Минимальное значение
                      100,  // _max       // Максимальное значение
                      1,    // _user      // Доступ в режиме пользователя
                      21);  // _def       // Значение по умолчанию


//=========================================================================================================
// Определение карты настроечных параметров
// И ее инициализация
//=========================================================================================================

MapsOfParameters mapsOfParameters;

// Новый поарметр должен быть добавлен в меню методом PutToMaps(параметр)
void MapsOfParameters::Init()
{
  PutToMaps (par1);
  PutToMaps (par2);
  //...
}


