//#####################################################################################
//	Файл				_Parameters.cpp
//	Название:		Классы настроечных параметров.
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 апр 27 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#include "_Parameters.h"

using namespace src;


// Конструктор без аргументов
//Parameter::Parameter() : _modbusAdr(0), _id(0), _text(0)
//{}
  
// Конструктор с аргументами
//Parameter::Parameter( const uint32_t modbusAdr, const uint32_t id, const char* text ) : _modbusAdr(modbusAdr), _id(id), _text(text)
//{}