//#####################################################################################
//	Файл				PWM.cpp
//	Название:		ШИМ для НО/НЗ.
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд |     	Кто		 		| Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 апр 23 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#include "_PWM.h"
#include "stdint.h"
#include "stm32f10x_rcc.h"



using namespace src;

//======================================================================================================================== 
// Pwm - генератор 3 фазного ШИМ
//======================================================================================================================== 
//	Методы:
//	setFrequency			- Установить частоту модуляции ШИМ
//	setValue					- Установить амплитуду сигнала (1-максамальный)
//	setBlock					- Установить/снять режим блокировки
//	computeDeathTime	- Установить мертвое время ШИМ. Имеет несколько реализаций под разное железо
//	init							- Инициализация. Имеет несколько реализаций под разное железо


void Pwm::setFrequency (float frequency)
{
	// В НО/НЗ не формируется модуляция.
	// Этот метод реализовать в другом проекте.
}


//	Установка Death Time. Зазается в микросекундах deathtime[мкс]
uint16_t Pwm::computeDeathTime (float deathTime)
{
	// Расчет death time зависит от текущей реализации. Реализуется в PWM_User.cpp
}



void Pwm::setValue (float value)
{

}


void Pwm::setBlock (float block)
{

}


void init	(void)
{
}

